БухЭксп/InformationRegisters/КосвенныеНалогиСведенияИзДОПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КосвенныеНалогиСведенияИзДОПП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНалогаАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УчетныйДокументДОПП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДОПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/СостоянияПоставкиТоваровИзЕАЭС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияПоставкиТоваровИзЕАЭС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
					<Comment>Товары ввезены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидается</Name>
					<Comment>Ожидается ввоз товаров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
					<Comment>Отмена поставки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продолжается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/ОтражениеДОППВДекларацииПоКосвеннымНалогам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтражениеДОППВДекларацииПоКосвеннымНалогам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КосвенныеНалогиСведенияИзДОПП</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.РасчетНачисленияНалоговНаЕНС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СведенияИзДокументовОПредстоящейПоставке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДОПП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйНомерДОПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПоставкиТоваровИзЕАЭС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбеспечительныйПлатежПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОприходования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбеспечительныеПлатежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КБК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбеспечительныйПлатежВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбеспечительныйПлатежКОтражению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоПриВвозе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДоплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/CommonModules/ПроведениеДокументовБП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроведенияФормированиеЗаписейРаздела7ДекларацииНДС(Документ, Движения, Отказ) Экспорт
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(Документ);
	
	ПараметрыПроведения = ПодготовитьПараметрыПроведения(Документ.Ссылка, Отказ);
	
	Если Документ.РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	СформироватьДвиженияРаздела7ДекларацииНДС(
		ПараметрыПроведения.ТаблицаЗаписиРаздела7, Движения, Отказ);
		
	СформироватьДвиженияСписаниеНеоблагаемыхНДСОпераций(
		ПараметрыПроведения.ТаблицаНеоблагаемыеОперации, Движения, Отказ);
		
	РегистрыСведений.ВыполнениеРегламентныхОперацийНДС.СформироватьДвиженияФактВыполненияРегламентнойОперации(
		ПараметрыПроведения.ДанныеРегламентнойОперации, Отказ);
		
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(Документ);

КонецПроцедуры

Процедура ОбработкаПроведенияДокументаОтражениеДОППВДекларацииПоКосвеннымНалогам(Документ, Движения, Отказ) Экспорт
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(Документ);
	
	ПараметрыПроведения = ПодготовитьПараметрыПроведенияОтражениеДОППВДекларацииПоКосвеннымНалогам(Документ, Отказ);
	
	Если Документ.РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДвиженияКосвенныеНалогиСведенияИзДОПП(
		ПараметрыПроведения.Реквизиты, ПараметрыПроведения.СведенияИзДОПП, Движения, Отказ);
		
	СформироватьДвиженияНачислениеНалоговНаЕНС(
		ПараметрыПроведения.Реквизиты, ПараметрыПроведения.ДоплатаНалога, Движения, Отказ);
		
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(Документ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокументаОтражениеДОППВДекларацииПоКосвеннымНалогам

Процедура СформироватьДвиженияНачислениеНалоговНаЕНС(ТаблицаРеквизиты, ДоплатаНалога, Движения, Отказ)
	
	Если Не ЗначениеЗаполнено(ТаблицаРеквизиты) Или Не ЗначениеЗаполнено(ДоплатаНалога) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыНачислениеНалоговНаЕНС(ТаблицаРеквизиты, ДоплатаНалога);
	Реквизиты = ТаблицаРеквизиты[0];
	
	МесяцУплаты               = ДобавитьМесяц(Реквизиты.Период, 1);
	СрокУплаты                = Дата(Год(МесяцУплаты), Месяц(МесяцУплаты), 20);
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	ГрафикПереноса            = КалендарныеГрафики.БлижайшиеРабочиеДаты(ПроизводственныйКалендарь, 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СрокУплаты));
	СрокУплатыСУчетомПереноса = ГрафикПереноса[СрокУплаты]; 
	
	Если Не УчетНДС.НачислениеКосвенныхНалоговНаЕНСРегламентнымДокументом(СрокУплатыСУчетомПереноса)
		Или Не УчетНДСПереопределяемый.ВедетсяПростойУчетЕНП(Реквизиты.Период, Реквизиты.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	НачислениеНалоговНаЕНС = ЕдиныйНалоговыйСчет.НовыйНачислениеНалоговНаЕНС();
	
	Для Каждого СтрокаТаблицы Из Параметры.ДоплатаНалога Цикл
		ДобавитьНачислениеНалоговНаЕНС(Реквизиты, СрокУплатыСУчетомПереноса, СтрокаТаблицы, НачислениеНалоговНаЕНС);
	КонецЦикла;
	
	ЕдиныйНалоговыйСчет.СформироватьДвиженияНачислениеНалоговНаЕНС(НачислениеНалоговНаЕНС, Реквизиты, Движения);
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

Процедура ДобавитьНачислениеНалоговНаЕНС(Реквизиты, СрокУплатыСУчетомПереноса, СтрокаТаблицыНачислений, НачислениеНалоговНаЕНС) Экспорт
	
	НоваяСтрока = НачислениеНалоговНаЕНС.Добавить();
	
	Если СтрокаТаблицыНачислений.НДСКДоплате <> 0 Тогда
		НоваяСтрока.СчетУчета             = ПланыСчетов.Хозрасчетный.НДСТаможенныйСоюзКУплате; // 68.42
		НоваяСтрока.СуммаНалога           = СтрокаТаблицыНачислений.НДСНачисленоПриВвозе;
		НоваяСтрока.Начислено             = СтрокаТаблицыНачислений.НДСКДоплате;
		НоваяСтрока.Сумма                 = СтрокаТаблицыНачислений.НДСКДоплате;
		НоваяСтрока.СуммаУменьшенияНалога = СтрокаТаблицыНачислений.НДСОбеспечительныйПлатеж;
	Иначе
		НоваяСтрока.СчетУчета             = ПланыСчетов.Хозрасчетный.АкцизТаможенныйСоюзКУплате; // 68.43
		НоваяСтрока.СуммаНалога           = СтрокаТаблицыНачислений.АкцизНачисленоПриВвозе;
		НоваяСтрока.Начислено             = СтрокаТаблицыНачислений.АкцизКДоплате;
		НоваяСтрока.Сумма                 = СтрокаТаблицыНачислений.АкцизКДоплате;
		НоваяСтрока.СуммаУменьшенияНалога = СтрокаТаблицыНачислений.АкцизОбеспечительныйПлатеж;
	КонецЕсли;
	
	НоваяСтрока.Субконто1     = СтрокаТаблицыНачислений.Контрагент;
	НоваяСтрока.Субконто2     = СтрокаТаблицыНачислений.ДоговорКонтрагента;
	НоваяСтрока.Субконто3     = СтрокаТаблицыНачислений.ДОПП;
	НоваяСтрока.СрокУплаты    = СрокУплатыСУчетомПереноса;
	НоваяСтрока.НачалоПериода = НачалоМесяца(Реквизиты.Период);
	НоваяСтрока.КонецПериода  = КонецМесяца(Реквизиты.Период);
	НоваяСтрока.Содержание    = НСтр("ru = 'Единый налоговый счет: Начисление налога за товары из ЕАЭС'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецПроцедуры

Функция ПодготовитьПараметрыНачислениеНалоговНаЕНС(ТаблицаРеквизиты, ДоплатаНалога)
	
	Параметры = Новый Структура;
	
	СписокОбязательныхКолонок = ""
		+ "НДСКДоплате,"                // <Число> - сумма НДС к доплате
		+ "АкцизКДоплате,"              // <Число> - сумма акциза к доплате
		+ "НДСОбеспечительныйПлатеж,"   // <Число> - сумма НДС обеспечительного платежа
		+ "АкцизОбеспечительныйПлатеж," // <Число> - сумма акциза обеспечительного платежа
		+ "НДСНачисленоПриВвозе,"       // <Число> - сумма НДС начисленная
		+ "АкцизНачисленоПриВвозе,"     // <Число> - сумма акциза начисленная
		+ "ДОПП,"                       // <ДокументСсылка.ЗаявлениеОВвозеТоваров> - ссылка на учетный документ ДОПП
		+ "Контрагент,"                 // <СправочникСсылка.Контрагенты> - ссылка на контрагента-поставщика по ДОПП
		+ "ДоговорКонтрагента";         // <СправочникСсылка.ДоговорыКонтрагентов> - ссылка договор с контрагентом-поставщиком по ДОПП
		
	Параметры.Вставить("ДоплатаНалога", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ДоплатаНалога, СписокОбязательныхКолонок));
		
	СписокОбязательныхКолонок = ""
		+ "Период,"            // <Дата> - период движений - дата документа
		+ "Регистратор,"       // <ДокументСсылка.ОтражениеДОППВДекларацииПоКосвеннымНалогам> - документ-регистратор движений
		+ "Организация";       // <СправочникСсылка.Организации> - организация
		
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
		
	Возврат Параметры;
	
КонецФункции

Процедура СформироватьДвиженияКосвенныеНалогиСведенияИзДОПП(ТаблицаРеквизиты, СведенияИзДОПП, Движения, Отказ)
	
	Если Не ЗначениеЗаполнено(ТаблицаРеквизиты) Или Не ЗначениеЗаполнено(СведенияИзДОПП) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыКосвенныеНалогиСведенияИзДОПП(ТаблицаРеквизиты, СведенияИзДОПП);
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Для Каждого СтрокаТаблицы Из Параметры.СведенияИзДОПП Цикл
		Запись = Движения.КосвенныеНалогиСведенияИзДОПП.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Реквизиты);
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
	КонецЦикла;
	
	Движения.КосвенныеНалогиСведенияИзДОПП.Записывать = Истина;
	
КонецПроцедуры

Функция ПодготовитьПараметрыКосвенныеНалогиСведенияИзДОПП(ТаблицаРеквизиты, ТаблицаДвижений)
	
	Параметры = Новый Структура;
	
	СписокОбязательныхКолонок = ""
		+ "КБК,"                 // <Строка> - код бюджетной классификации налога или акциза
		+ "ДОПП,"                // <Строка> - регистрационный номер ДОПП
		+ "УчетныйДокументДОПП," // <ДокументСсылка.ЗаявлениеОВвозеТоваров> - ссылка на учетный документ ДОПП
		+ "СуммаНалогаАкциза";   // <Число>
	
	Параметры.Вставить("СведенияИзДОПП", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаДвижений, СписокОбязательныхКолонок));
		
	СписокОбязательныхКолонок = ""
		+ "Период,"            // <Дата> - период движений - дата документа
		+ "Регистратор,"       // <ДокументСсылка.ОтражениеДОППВДекларацииПоКосвеннымНалогам> - документ-регистратор движений
		+ "Организация";       // <СправочникСсылка.Организации> - организация

	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
		
	Возврат Параметры;
	
КонецФункции

Функция ПодготовитьПараметрыПроведенияОтражениеДОППВДекларацииПоКосвеннымНалогам(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка.Ссылка);
	Запрос.Текст = ТекстЗапросаРеквизитыДокументаОтражениеДОППВДекларацииПоКосвеннымНалогам();
	Результат = Запрос.Выполнить();
	ПараметрыПроведения.Вставить("Реквизиты", Результат.Выгрузить());
	Реквизиты = ПараметрыПроведения.Реквизиты[0];
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаСведенияИзДОПП(НомераТаблиц);
	Запрос.УстановитьПараметр("НулевойКБК", УчетНДСОтчетыПереопределяемый.НулевойКБКПриВвозеТоваров());
	Запрос.УстановитьПараметр("КБКНДС", УчетНДСОтчетыПереопределяемый.КБКНДСПриВвозеТоваров());
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаРеквизитыДокументаОтражениеДОППВДекларацииПоКосвеннымНалогам()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.ОтражениеДОППВДекларацииПоКосвеннымНалогам КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСведенияИзДОПП(НомераТаблиц)

	НомераТаблиц.Вставить("СведенияИзДОПП", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ДоплатаНалога",  НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияИзДокументовОПредстоящейПоставке.РегистрационныйНомерДОПП КАК ДОПП,
	|	ВЫБОР
	|		КОГДА ОбеспечительныеПлатежи.ОбеспечительныйПлатежВсего = 0
	|			ТОГДА &НулевойКБК
	|		ИНАЧЕ ОбеспечительныеПлатежи.КБК
	|	КОНЕЦ КАК КБК,
	|	ОбеспечительныеПлатежи.ОбеспечительныйПлатежКОтражению КАК СуммаНалогаАкциза,
	|	СведенияИзДокументовОПредстоящейПоставке.ДОПП КАК УчетныйДокументДОПП
	|ИЗ
	|	Документ.ОтражениеДОППВДекларацииПоКосвеннымНалогам.СведенияИзДокументовОПредстоящейПоставке КАК СведенияИзДокументовОПредстоящейПоставке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеДОППВДекларацииПоКосвеннымНалогам.ОбеспечительныеПлатежи КАК ОбеспечительныеПлатежи
	|		ПО СведенияИзДокументовОПредстоящейПоставке.КлючСтроки = ОбеспечительныеПлатежи.КлючСтроки
	|ГДЕ
	|	ОбеспечительныеПлатежи.Ссылка = &Ссылка
	|	И СведенияИзДокументовОПредстоящейПоставке.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияПоставкиТоваровИзЕАЭС.Ожидается)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ОбеспечительныеПлатежи.КБК = &КБКНДС
	|			ТОГДА ОбеспечительныеПлатежи.КДоплате
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДСКДоплате,
	|	ВЫБОР
	|		КОГДА ОбеспечительныеПлатежи.КБК <> &КБКНДС
	|			ТОГДА ОбеспечительныеПлатежи.КДоплате
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АкцизКДоплате,
	|	ВЫБОР
	|		КОГДА ОбеспечительныеПлатежи.КБК = &КБКНДС
	|			ТОГДА ОбеспечительныеПлатежи.ОбеспечительныйПлатежКОтражению
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДСОбеспечительныйПлатеж,
	|	ВЫБОР
	|		КОГДА ОбеспечительныеПлатежи.КБК <> &КБКНДС
	|			ТОГДА ОбеспечительныеПлатежи.ОбеспечительныйПлатежКОтражению
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АкцизОбеспечительныйПлатеж,
	|	ВЫБОР
	|		КОГДА ОбеспечительныеПлатежи.КБК = &КБКНДС
	|			ТОГДА ОбеспечительныеПлатежи.НачисленоПриВвозе
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДСНачисленоПриВвозе,
	|	ВЫБОР
	|		КОГДА ОбеспечительныеПлатежи.КБК <> &КБКНДС
	|			ТОГДА ОбеспечительныеПлатежи.НачисленоПриВвозе
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АкцизНачисленоПриВвозе,
	|	СведенияИзДокументовОПредстоящейПоставке.ДОПП КАК ДОПП,
	|	ДанныеДОПП.Контрагент КАК Контрагент,
	|	ДанныеДОПП.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.ОтражениеДОППВДекларацииПоКосвеннымНалогам.СведенияИзДокументовОПредстоящейПоставке КАК СведенияИзДокументовОПредстоящейПоставке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеДОППВДекларацииПоКосвеннымНалогам.ОбеспечительныеПлатежи КАК ОбеспечительныеПлатежи
	|		ПО СведенияИзДокументовОПредстоящейПоставке.КлючСтроки = ОбеспечительныеПлатежи.КлючСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеОВвозеТоваров КАК ДанныеДОПП
	|		ПО СведенияИзДокументовОПредстоящейПоставке.ДОПП = ДанныеДОПП.Ссылка
	|ГДЕ
	|	ОбеспечительныеПлатежи.Ссылка = &Ссылка
	|	И СведенияИзДокументовОПредстоящейПоставке.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияПоставкиТоваровИзЕАЭС.Ожидается)
	|	И ОбеспечительныеПлатежи.КДоплате <> 0";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти

#Область ПодготовкаПараметровПроведенияФормированияРаздела7

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента();
	Результат = Запрос.Выполнить();
	ПараметрыПроведения.Вставить("Реквизиты", Результат.Выгрузить());
	Реквизиты = ПараметрыПроведения.Реквизиты[0];
	
	Если НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Период, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",                Реквизиты.Организация);
	Запрос.УстановитьПараметр("ДатаДокумента",              Реквизиты.Период);
	Запрос.УстановитьПараметр("ДатаГраница", Новый Граница(КонецДня(Реквизиты.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КодыРеализацийНеНаТерриторииРФ", 
		Справочники.КодыОперацийРаздела7ДекларацииПоНДС.КодыРеализацииНеНаТерриторииРФ());
	Запрос.УстановитьПараметр("ПравилаЗаполненияДекларацииС4кв2020", 
		УчетНДС.ПравилаЗаполненияДекларацииС4кв2020(Реквизиты.Период));
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаЗаписиРаздела7(НомераТаблиц)
		+ ТекстЗапросаНеоблагаемыеНДСОперации(НомераТаблиц)
		+ ТекстЗапросаПоФормированиюРегламентнойОперации(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаПоФормированиюРегламентнойОперации(НомераТаблиц)

	НомераТаблиц.Вставить("ДанныеРегламентнойОперации", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ФормированиеЗаписейРаздела7ДекларацииНДС) КАК РегламентнаяОперация
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаРеквизитыДокумента()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаРеквизитыДокумента()

Функция ТекстЗапросаЗаписиРаздела7(НомераТаблиц)
	
	НомераТаблиц.Вставить("ТаблицаЗаписиРаздела7", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации КАК КодОперации,
	|	СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации) КАК СуммаРеализации,
	|	СУММА(ВЫБОР
	|			КОГДА &ПравилаЗаполненияДекларацииС4кв2020
	|				ТОГДА ВЫБОР
	|						КОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации В (&КодыРеализацийНеНаТерриторииРФ)
	|							ТОГДА 0
	|						ИНАЧЕ ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаПриобретения
	|					КОНЕЦ
	|			КОГДА КодыОперацийРаздела7ДекларацииПоНДС.ОперацияНеПодлежитНалогообложению
	|				ТОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаПриобретения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПриобретения,
	|	СУММА(ВЫБОР
	|			КОГДА &ПравилаЗаполненияДекларацииС4кв2020
	|				ТОГДА ВЫБОР
	|						КОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации В (&КодыРеализацийНеНаТерриторииРФ)
	|							ТОГДА 0
	|						ИНАЧЕ ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСПрямой + ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСРаспределенный
	|					КОНЕЦ
	|			КОГДА КодыОперацийРаздела7ДекларацииПоНДС.ОперацияНеПодлежитНалогообложению
	|				ТОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСПрямой + ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСРаспределенный
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДС,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата КАК Период,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Ссылка КАК Регистратор,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация КАК Организация
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.НеоблагаемыеНДСОперации КАК ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыОперацийРаздела7ДекларацииПоНДС КАК КодыОперацийРаздела7ДекларацииПоНДС
	|		ПО ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации = КодыОперацийРаздела7ДекларацииПоНДС.Ссылка
	|ГДЕ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Ссылка,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаНеоблагаемыеНДСОперации(НомераТаблиц)
	
	НомераТаблиц.Вставить("НеоблагаемыеОперацииОстаткиПредварительная", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("НеоблагаемыеОперацииОстатки",     НомераТаблиц.Количество());
	НомераТаблиц.Вставить("НеоблагаемыеОперацииПоДокументу", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаНеоблагаемыеОперации",     НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НДСНеоблагаемыеОперацииОстатки.Организация КАК Организация,
	|	НДСНеоблагаемыеОперацииОстатки.КодОперации КАК КодОперации,
	|	НДСНеоблагаемыеОперацииОстатки.Контрагент КАК Контрагент,
	|	НДСНеоблагаемыеОперацииОстатки.ДокументРеализации КАК ДокументРеализации,
	|	СУММА(НДСНеоблагаемыеОперацииОстатки.СуммаРеализацииБезНДСОстаток) КАК СуммаРеализации,
	|	СУММА(НДСНеоблагаемыеОперацииОстатки.СуммаПриобретенияБезНДСОстаток) КАК СуммаПриобретения,
	|	СУММА(НДСНеоблагаемыеОперацииОстатки.СуммаНДСНеПодлежащаяВычетуОстаток) КАК СуммаНДС
	|ПОМЕСТИТЬ НеоблагаемыеОперацииОстаткиПредварительная
	|ИЗ
	|	РегистрНакопления.НДСНеоблагаемыеОперации.Остатки(&ДатаГраница, Организация = &Организация) КАК НДСНеоблагаемыеОперацииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСНеоблагаемыеОперацииОстатки.Контрагент,
	|	НДСНеоблагаемыеОперацииОстатки.КодОперации,
	|	НДСНеоблагаемыеОперацииОстатки.Организация,
	|	НДСНеоблагаемыеОперацииОстатки.ДокументРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСНеоблагаемыеОперации.Организация,
	|	НДСНеоблагаемыеОперации.КодОперации,
	|	НДСНеоблагаемыеОперации.Контрагент,
	|	НДСНеоблагаемыеОперации.ДокументРеализации,
	|	НДСНеоблагаемыеОперации.СуммаРеализацииБезНДС,
	|	НДСНеоблагаемыеОперации.СуммаПриобретенияБезНДС,
	|	НДСНеоблагаемыеОперации.СуммаНДСНеПодлежащаяВычету
	|ИЗ
	|	РегистрНакопления.НДСНеоблагаемыеОперации КАК НДСНеоблагаемыеОперации
	|ГДЕ
	|	НДСНеоблагаемыеОперации.Регистратор = &Ссылка
	|	И НДСНеоблагаемыеОперации.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	ДокументРеализации,
	|	КодОперации,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеоблагаемыеОперацииОстаткиПредварительная.Организация,
	|	НеоблагаемыеОперацииОстаткиПредварительная.КодОперации,
	|	НеоблагаемыеОперацииОстаткиПредварительная.Контрагент,
	|	НеоблагаемыеОперацииОстаткиПредварительная.ДокументРеализации,
	|	СУММА(НеоблагаемыеОперацииОстаткиПредварительная.СуммаРеализации) КАК СуммаРеализации,
	|	СУММА(НеоблагаемыеОперацииОстаткиПредварительная.СуммаПриобретения) КАК СуммаПриобретения,
	|	СУММА(НеоблагаемыеОперацииОстаткиПредварительная.СуммаНДС) КАК СуммаНДС
	|ПОМЕСТИТЬ НеоблагаемыеОперацииОстатки
	|ИЗ
	|	НеоблагаемыеОперацииОстаткиПредварительная КАК НеоблагаемыеОперацииОстаткиПредварительная
	|ГДЕ
	|	(НеоблагаемыеОперацииОстаткиПредварительная.СуммаРеализации > 0
	|			ИЛИ НеоблагаемыеОперацииОстаткиПредварительная.СуммаПриобретения > 0
	|			ИЛИ НеоблагаемыеОперацииОстаткиПредварительная.СуммаНДС > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	НеоблагаемыеОперацииОстаткиПредварительная.ДокументРеализации,
	|	НеоблагаемыеОперацииОстаткиПредварительная.Организация,
	|	НеоблагаемыеОперацииОстаткиПредварительная.КодОперации,
	|	НеоблагаемыеОперацииОстаткиПредварительная.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация КАК Организация,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент КАК Контрагент,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.ДокументРеализации КАК ДокументРеализации,
	|	СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации) КАК СуммаРеализации,
	|	СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаПриобретения) КАК СуммаПриобретения,
	|	СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСПрямой) КАК НДС,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации КАК КодОперации,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата КАК Период,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Ссылка КАК Регистратор
	|ПОМЕСТИТЬ НеоблагаемыеОперацииПоДокументу
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.НеоблагаемыеНДСОперации КАК ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации
	|ГДЕ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.ДокументРеализации,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.НДСРаспределенный),
	|	ЗНАЧЕНИЕ(Справочник.КодыОперацийРаздела7ДекларацииПоНДС.ПустаяСсылка),
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Ссылка
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.НеоблагаемыеНДСОперации КАК ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации
	|ГДЕ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	ДокументРеализации,
	|	КодОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеоблагаемыеОперацииОстатки.Организация,
	|	НеоблагаемыеОперацииОстатки.КодОперации,
	|	НеоблагаемыеОперацииОстатки.Контрагент,
	|	НеоблагаемыеОперацииОстатки.ДокументРеализации,
	|	СУММА(ВЫБОР
	|			КОГДА НеоблагаемыеОперацииПоДокументу.СуммаРеализации > НеоблагаемыеОперацииОстатки.СуммаРеализации
	|				ТОГДА НеоблагаемыеОперацииОстатки.СуммаРеализации
	|			ИНАЧЕ НеоблагаемыеОперацииПоДокументу.СуммаРеализации
	|		КОНЕЦ) КАК СуммаРеализацииБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА НеоблагаемыеОперацииПоДокументу.СуммаПриобретения > НеоблагаемыеОперацииОстатки.СуммаПриобретения
	|				ТОГДА НеоблагаемыеОперацииОстатки.СуммаПриобретения
	|			ИНАЧЕ НеоблагаемыеОперацииПоДокументу.СуммаПриобретения
	|		КОНЕЦ) КАК СуммаПриобретенияБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА НеоблагаемыеОперацииПоДокументу.НДС > НеоблагаемыеОперацииОстатки.СуммаНДС
	|				ТОГДА НеоблагаемыеОперацииОстатки.СуммаНДС
	|			ИНАЧЕ НеоблагаемыеОперацииПоДокументу.НДС
	|		КОНЕЦ) КАК СуммаНДСНеПодлежащаяВычету,
	|	НеоблагаемыеОперацииПоДокументу.Период,
	|	НеоблагаемыеОперацииПоДокументу.Регистратор
	|ИЗ
	|	НеоблагаемыеОперацииОстатки КАК НеоблагаемыеОперацииОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НеоблагаемыеОперацииПоДокументу КАК НеоблагаемыеОперацииПоДокументу
	|		ПО НеоблагаемыеОперацииОстатки.Организация = НеоблагаемыеОперацииПоДокументу.Организация
	|			И НеоблагаемыеОперацииОстатки.КодОперации = НеоблагаемыеОперацииПоДокументу.КодОперации
	|			И НеоблагаемыеОперацииОстатки.Контрагент = НеоблагаемыеОперацииПоДокументу.Контрагент
	|			И НеоблагаемыеОперацииОстатки.ДокументРеализации = НеоблагаемыеОперацииПоДокументу.ДокументРеализации
	|
	|СГРУППИРОВАТЬ ПО
	|	НеоблагаемыеОперацииОстатки.КодОперации,
	|	НеоблагаемыеОперацииОстатки.ДокументРеализации,
	|	НеоблагаемыеОперацииОстатки.Организация,
	|	НеоблагаемыеОперацииОстатки.Контрагент,
	|	НеоблагаемыеОперацииПоДокументу.Период,
	|	НеоблагаемыеОперацииПоДокументу.Регистратор";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти

#Область ПроведениеДокументаФормированияРаздела7

// Формирование записей раздела 7 Декларации НДС
Процедура СформироватьДвиженияРаздела7ДекларацииНДС(ТаблицаДвижений, Движения, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаДвижений) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыНДСЗаписиРаздела7Декларации(ТаблицаДвижений);
	
	Для Каждого СтрокаТаблицы Из Параметры.ТаблицаНДСЗаписиРаздела7Декларации Цикл
		Запись = Движения.НДСЗаписиРаздела7Декларации.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
	КонецЦикла;
	
	Движения.НДСЗаписиРаздела7Декларации.Записывать = Истина;
	
КонецПроцедуры

Функция ПодготовитьПараметрыНДСЗаписиРаздела7Декларации(ТаблицаДвижений)
	
	Параметры = Новый Структура;
	
	СписокОбязательныхКолонок = ""
	+ "Период,"            // <Дата> - период движений - дата документа
	+ "Регистратор,"       // <ДокументСсылка.ФормированиеЗаписейРаздела7ДекларацииНДС> - документ-регистратор движений
	+ "Организация,"       // <СправочникСсылка.Организации> - организация
	+ "КодОперации,"       // <СправочникСсылка.КодыОперацийРаздела7ДекларацииПоНДС> - код операции для раздела 7 Декларации 
	+ "СуммаРеализации,"   // <Число> 
	+ "СуммаПриобретения," // <Число>
	+ "СуммаНДС";          // <Число>
	
	Параметры.Вставить("ТаблицаНДСЗаписиРаздела7Декларации", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
			ТаблицаДвижений, СписокОбязательныхКолонок));
			
	Возврат Параметры;
	
КонецФункции

Процедура СформироватьДвиженияСписаниеНеоблагаемыхНДСОпераций(ТаблицаНеоблагаемыеОперации, Движения, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаНеоблагаемыеОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыСписаниеНеоблагаемыхОпераций(ТаблицаНеоблагаемыеОперации);
	
	Для Каждого СтрокаТаблицы Из Параметры.ТаблицаНеоблагаемыеОперации Цикл
		Запись = Движения.НДСНеоблагаемыеОперации.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
	КонецЦикла;
	
	Движения.НДСНеоблагаемыеОперации.Записывать = Истина;
	
КонецПроцедуры

Функция ПодготовитьПараметрыСписаниеНеоблагаемыхОпераций(ТаблицаНеоблагаемыеОперации)
	
	Параметры = Новый Структура;
	
	СписокОбязательныхКолонок = ""
	+ "Период,"                     // <Дата> - период движений - дата документа
	+ "Регистратор,"                // <ДокументСсылка.ФормированиеЗаписейРаздела7ДекларацииНДС> - документ-регистратор движений
	+ "Организация,"                // <СправочникСсылка.Организации> - организация
	+ "КодОперации,"                // <СправочникСсылка.КодыОперацийРаздела7ДекларацииПоНДС> - код операции для раздела 7 Декларации
	+ "Контрагент,"                 // <СправочникСсылка.Контрагенты>
	+ "ДокументРеализации,"         // <ДокументСсылка...>  - документ-регистратор необлагаемой НДС операции
	+ "СуммаРеализацииБезНДС,"      // <Число>
	+ "СуммаПриобретенияБезНДС,"    // <Число>
	+ "СуммаНДСНеПодлежащаяВычету"; // <Число>
	
	Параметры.Вставить("ТаблицаНеоблагаемыеОперации", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
			ТаблицаНеоблагаемыеОперации, СписокОбязательныхКолонок));
			
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецОбласти
